
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Если уже есть локальный каталог скрыть кнопку создания нового
	Если ЗначениеЗаполнено(Объект.ЛокальныйКаталог) Тогда
		Элементы.СоздатьЛокальныйКаталог.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЧастиАдресаПриИзменении(Элемент)
	Объект.Наименование  =  УстановитьНовоеНаименование(Объект.АдресРесурса,Объект.Ветка);
КонецПроцедуры

&НаСервере
Процедура СоздатьКаталогНаСервере()
	// """ в транзакции создать новый каталог в справочник алгоритмов, записать этот элемент,  сделать запись в регистре ИерархияПакетов """
	НачатьТранзакцию();
	
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	Если ТекущийОбъект.ЭтоНовый()Тогда
		СсылкаНаТекущийОбъект = Справочники._37583_Репозитории_GitHub.ПолучитьСсылку();
		ТекущийОбъект.УстановитьСсылкуНового(СсылкаНаТекущийОбъект);
	Иначе
		СсылкаНаТекущийОбъект = Объект.Ссылка;
	КонецЕсли;
	
	НоваяГруппаАлгоритмы = Справочники._37583_ALG.СоздатьГруппу();
	НоваяГруппаАлгоритмы.Наименование = Объект.Наименование;
	НоваяГруппаАлгоритмы.Репозиторий = СсылкаНаТекущийОбъект;
	НоваяГруппаАлгоритмы.Записать();
	
	МенеджерЗаписиИерархия = РегистрыСведений._37583_ИераррхияПакетов.СоздатьМенеджерЗаписи();
	МенеджерЗаписиИерархия.Репозиторий = СсылкаНаТекущийОбъект;
	МенеджерЗаписиИерархия.Пакет = НоваяГруппаАлгоритмы.Ссылка;
	МенеджерЗаписиИерархия.Записать();
	
	ТекущийОбъект.ЛокальныйКаталог = НоваяГруппаАлгоритмы.Ссылка;
    ЗначениеВРеквизитФормы(ТекущийОбъект,"Объект");
	
	Если ТранзакцияАктивна() Тогда
		ЗафиксироватьТранзакцию();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция УстановитьНовоеНаименование(АдресРесурса,Ветка)
	Возврат АдресРесурса +"?ref=" + ?(ПустаяСтрока(Ветка),"master",СокрЛП(Ветка));
КонецФункции // УстановитьНовоеНаименование()

&НаКлиенте
Процедура СоздатьЛокальныйКаталог(Команда)
	Если Не ЗначениеЗаполнено(Объект.АдресРесурса) Или  Не ЗначениеЗаполнено(Объект.Наименование) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Необходимо установить наименование";
		Сообщение.Поле = "Наименование";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	СоздатьКаталогНаСервере();
КонецПроцедуры
