Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("3.0.1.127");
	ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
	ПараметрыРегистрации.Версия = "1.0.01";
	
	_37583_СтандартныеПодсистемы.ЗаполнитьКомандыРегламентныеЗадания(ПараметрыРегистрации);
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

Процедура ВыполнитьКоманду(ИмяКоманды, ПараметрыВыполнения) Экспорт
	_37583_АлгоритмыСервер.ВыполнитьРегламентнуюПроцедуру(ИмяКоманды);
КонецПроцедуры

