
&НаКлиенте
Процедура ВыполнитьКоманду(ПараметрКоманды,ПараметрВыполненияКоманды) Экспорт
    ДополнительныеПараметры = Новый Структура ("ВыбранныеОбъекты, ПараметрКоманды, ПараметрВыполненияКоманды",Параметры.ВыбранныеОбъекты,ПараметрКоманды,ПараметрВыполненияКоманды );
    _37583_АлгоритмыКлиент.ВыполнитьПроцедуру(Параметры.Алгоритм,ДополнительныеПараметры);
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикДействия1 (АлгоритмНаКлиенте) 
Сообщить("ОбработчикДействия1");
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикДействия2 (АлгоритмНаКлиенте , Параметр2) 
Сообщить("ОбработчикДействия2");
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикДействия3 (АлгоритмНаКлиенте , Параметр2, Параметр3) 
Сообщить("ОбработчикДействия3");
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикДействия4 (АлгоритмНаКлиенте , Параметр2, Параметр3 , Параметр4) 
Сообщить("ОбработчикДействия4");
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    Если ПустаяСтрока(Параметры.ОписаниеКоманды.Обработчик) Тогда /// Отрисовка формы
        ДополнительныеПараметры = Новый Структура ("ВыбранныеОбъекты,Форма",Параметры.ВыбранныеОбъекты,ЭтотОбъект);
        _37583_АлгоритмыСервер.ВыполнитьПроцедуру(Параметры.Алгоритм,ДополнительныеПараметры);
    КонецЕсли;
КонецПроцедуры

