
&НаКлиенте
Процедура ВыполнитьКоманду(ПараметрКоманды,ПараметрВыполненияКоманды) Экспорт
	// срабатывает если у алгоритма  есть  признак "НаКлиенте" , у команды отсутствует признак "открыть форму"
    ДополнительныеПараметры = Новый Структура ("ВыбранныеОбъекты, ПараметрКоманды, ПараметрВыполненияКоманды",Параметры.ВыбранныеОбъекты,ПараметрКоманды,ПараметрВыполненияКоманды );
    _37583_АлгоритмыКлиент.ВыполнитьФункцию(Параметры.Алгоритм,ДополнительныеПараметры);
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// срабатывает если у алгоритма  есть  признак "НаКлиенте" и  у команды  есть признак "открыть форму"
    Если ПустаяСтрока(Параметры.ОписаниеКоманды.Обработчик) Тогда /// Отрисовка формы
        ДополнительныеПараметры = Новый Структура ("ВыбранныеОбъекты,Форма",Параметры.ВыбранныеОбъекты,ЭтотОбъект);
        _37583_АлгоритмыСервер.ВыполнитьФункцию(Параметры.Алгоритм,ДополнительныеПараметры);
    КонецЕсли;
КонецПроцедуры

