
&НаКлиенте
Процедура ВыполнитьКоманду(ПараметрКоманды,ПараметрВыполненияКоманды) Экспорт
	// срабатывает если у алгоритма  есть  признак "НаКлиенте" , у команды отсутствует признак "открыть форму"
    ДополнительныеПараметры = Новый Структура ("ВыбранныеОбъекты, ПараметрКоманды, ПараметрВыполненияКоманды",Параметры.ВыбранныеОбъекты,ПараметрКоманды,ПараметрВыполненияКоманды );
    _37583_АлгоритмыКлиент.ВыполнитьПроцедуру(Параметры.Алгоритм,ДополнительныеПараметры);
КонецПроцедуры

// Заглушки обработчиков действий
&НаКлиенте
Процедура ОбработчикДействия1 (АлгоритмНаКлиенте)Экспорт 
Сообщить("ОбработчикДействия1");
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикДействия2 (АлгоритмНаКлиенте , Параметр2)Экспорт 
Сообщить("ОбработчикДействия2");
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикДействия3 (АлгоритмНаКлиенте , Параметр2, Параметр3)Экспорт 
Сообщить("ОбработчикДействия3");
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикДействия4 (АлгоритмНаКлиенте , Параметр2, Параметр3 , Параметр4)Экспорт 
Сообщить("ОбработчикДействия4");
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// срабатывает если у алгоритма  есть  признак "НаКлиенте" и  у команды  есть признак "открыть форму"
    Если ПустаяСтрока(Параметры.ОписаниеКоманды.Обработчик) Тогда /// Отрисовка формы
        ДополнительныеПараметры = Новый Структура ("ВыбранныеОбъекты,Форма",Параметры.ВыбранныеОбъекты,ЭтотОбъект);
        _37583_АлгоритмыСервер.ВыполнитьПроцедуру(Параметры.Алгоритм,ДополнительныеПараметры);
    КонецЕсли;
КонецПроцедуры

