
#Область ПрограммныйИнтерфейс

Функция ВыполнитьФункцию(Алгоритм,ДополнительныеПараметры=Неопределено) Экспорт
	Если Алгоритм=Неопределено Или Алгоритм.Пустая() Тогда
		СообщениеОбОшибке="RP:Ошибка выполнения функции(не определен сценарий "+Алгоритм+" )";
		_37583_АлгоритмыСервер.ЗаписатьВЖурналРегистрации(СообщениеОбОшибке);
		сВозврат = Новый Соответствие;
		сВозврат["Отказ"] = Истина;
		сВозврат["СообщениеОбОшибке"] = СообщениеОбОшибке;
		Возврат сВозврат;
	КонецЕсли;
	Объект=Алгоритм.ПолучитьОбъект();
	Возврат  Объект.ВыполнитьФункцию(ДополнительныеПараметры);
КонецФункции

Функция ПолучитьПараметры_37583() Экспорт
	Настройки37583 = _37583_АлгоритмыСервер.ПолучитьПараметры("_37583");
	Возврат Настройки37583;
КонецФункции

Процедура ОчиститьКэш() Экспорт
	ОбновитьПовторноИспользуемыеЗначения(); 
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс_БСП

Функция  ПолучитьТаблицуВидовПодключаемыхКоманд() Экспорт
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ РАЗЛИЧНЫЕ
    |   _37583_ALGКомандныйИнтерфейс.ГруппаКоманд КАК ГруппаКоманд
    |ИЗ
    |   Справочник._37583_ALG.КомандныйИнтерфейс КАК _37583_ALGКомандныйИнтерфейс
    |
    |УПОРЯДОЧИТЬ ПО
    |   ГруппаКоманд";
    
    ТаблицаВидовПодключаемыхКоманд  = Запрос.Выполнить().Выгрузить();
    Для Каждого СтрТаб Из ТаблицаВидовПодключаемыхКоманд Цикл
        
        Если  ПустаяСтрока(СтрТаб.ГруппаКоманд) Тогда 
            СтрТаб.ГруппаКоманд = "Алгоритмы";
        Иначе
            СтрТаб.ГруппаКоманд = _37583_ОбщегоНазначенияКлиентСервер.СклеитьСтроку(СтрТаб.ГруппаКоманд);
        КонецЕсли;
        
    КонецЦикла;
    ТаблицаВидовПодключаемыхКоманд.Свернуть("ГруппаКоманд");
    Возврат ТаблицаВидовПодключаемыхКоманд;
КонецФункции 


#КонецОбласти
