
#Область ПрограммныйИнтерфейс

Функция ВыполнитьФункцию(Алгоритм,ДополнительныеПараметры=Неопределено,ОшибкаВыполнения = Ложь,СообщениеОбОшибке = "") Экспорт
		
	Если Алгоритм = Неопределено Или Алгоритм.Пустая() Тогда
		СообщениеОбОшибке = " Ошибка выполнения (не определен сценарий )";
		ОшибкаВыполнения = Истина;
		_37583_АлгоритмыСервер.ЗаписатьВЖурналРегистрации(" ВыполнитьФункцию (Кэширование) ",СообщениеОбОшибке);
		Если ДополнительныеПараметры = Неопределено Тогда 
			ДополнительныеПараметры = Новый Структура;
		КонецЕсли;
		ДополнительныеПараметры.Вставить("Отказ",Истина);
		ДополнительныеПараметры.Вставить("СообщениеОбОшибке",СообщениеОбОшибке);
		Ответ = Новый Соответствие;
		Ответ.Вставить("Результат",Неопределено);
		Возврат Ответ;
	КонецЕсли;
	
	Объект = Алгоритм.ПолучитьОбъект();
	
	РезультатВыполнения = Объект.ВыполнитьФункцию(ДополнительныеПараметры);
	
	СообщениеОбОшибке = ДополнительныеПараметры.СообщениеОбОшибке;
	ОшибкаВыполнения = ДополнительныеПараметры.Отказ;
	
	Возврат  РезультатВыполнения;
	
КонецФункции

Процедура ОчиститьКэш() Экспорт
	ОбновитьПовторноИспользуемыеЗначения(); 
КонецПроцедуры

Функция ПолучитьНастройкиПоУмолчанию() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	_37583_ALG.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник._37583_ALG КАК _37583_ALG
	|ГДЕ
	|	_37583_ALG.ХранилищеНастроек = ИСТИНА";
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если  ВыборкаДетальныеЗаписи.Следующий() Тогда
		Настройки37583 = _37583_АлгоритмыСервер.ПолучитьПараметры(ВыборкаДетальныеЗаписи.Ссылка);
	Иначе
		Настройки37583 = Новый Структура;
	КонецЕсли;
	Возврат Настройки37583;
КонецФункции

#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс_БСП

Функция  ПолучитьТаблицуВидовПодключаемыхКоманд() Экспорт
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ РАЗЛИЧНЫЕ
    |   _37583_ALGКомандныйИнтерфейс.ГруппаКоманд КАК ГруппаКоманд
    |ИЗ
    |   Справочник._37583_ALG.КомандныйИнтерфейс КАК _37583_ALGКомандныйИнтерфейс
    |
    |УПОРЯДОЧИТЬ ПО
    |   ГруппаКоманд";
    
    ТаблицаВидовПодключаемыхКоманд  = Запрос.Выполнить().Выгрузить();
    Для Каждого СтрТаб Из ТаблицаВидовПодключаемыхКоманд Цикл
        
        Если  ПустаяСтрока(СтрТаб.ГруппаКоманд) Тогда 
            СтрТаб.ГруппаКоманд = "Алгоритмы";
        Иначе
            СтрТаб.ГруппаКоманд = _37583_ОбщегоНазначенияКлиентСервер.СклеитьСтроку(СтрТаб.ГруппаКоманд);
        КонецЕсли;
        
	КонецЦикла;
	
    ТаблицаВидовПодключаемыхКоманд.Свернуть("ГруппаКоманд");
	
    Возврат ТаблицаВидовПодключаемыхКоманд;
	
КонецФункции 

// НеБСП
Функция КэшФормы(Знач ИмяФормы, Знач ЭтоФормаОбъекта) Экспорт
	Возврат _37583_ПодключаемыеКомандыИОбработчики.КэшТаблицыКоманд(ИмяФормы,ЭтоФормаОбъекта);
КонецФункции

#КонецОбласти
