
&После("ПриОпределенииВидовПодключаемыхКоманд")
Процедура _37583_ПриОпределенииВидовПодключаемыхКоманд(ВидыПодключаемыхКоманд)
    
    ТаблицаВидовПодключаемыхКоманд  = _37583_АлгоритмыКэш.ПолучитьТаблицуВидовПодключаемыхКоманд();
    
    Для Каждого СтрТаб Из ТаблицаВидовПодключаемыхКоманд Цикл
        
        Вид = ВидыПодключаемыхКоманд.Добавить();
        Вид.Имя         = СтрТаб.ГруппаКоманд;
        Вид.ИмяПодменю  = "Подменю"+СтрТаб.ГруппаКоманд;
        Вид.Заголовок   = НСтр("ru = '"+СтрТаб.ГруппаКоманд+"'");
        Вид.Картинка    = БиблиотекаКартинок.ВнешнийИсточникДанныхКуб;
        Вид.Отображение = ОтображениеКнопки.КартинкаИТекст;
        
    КонецЦикла;
КонецПроцедуры

&После("ПриОпределенииКомандПодключенныхКОбъекту")
Процедура _37583_ПриОпределенииКомандПодключенныхКОбъекту(НастройкиФормы, Источники, ПодключенныеОтчетыИОбработки, Команды)
    
    _37583_СтандартныеПодсистемы.ПриОпределенииКомандПодключенныхКОбъекту(НастройкиФормы,Источники,ПодключенныеОтчетыИОбработки,Команды);
    
КонецПроцедуры
