
&После("ПриОпределенииВидовПодключаемыхКоманд")
Процедура _37583_ПриОпределенииВидовПодключаемыхКоманд(ВидыПодключаемыхКоманд)
    
    Если  РольДоступна("_37583_РедактированиеАлгоритмов") Или РольДоступна("_37583_ИспользованиеАлгоритмов") Тогда
        
        ТаблицаВидовПодключаемыхКоманд  = _37583_АлгоритмыКэш.ПолучитьТаблицуВидовПодключаемыхКоманд();
        
        Для Каждого СтрТаб Из ТаблицаВидовПодключаемыхКоманд Цикл
            
            Вид = ВидыПодключаемыхКоманд.Добавить();
            Вид.Имя         = СтрТаб.ГруппаКоманд;
            Вид.ИмяПодменю  = "Подменю"+СтрТаб.ГруппаКоманд;
            Вид.Заголовок   = НСтр("ru = '"+СтрТаб.ГруппаКоманд+"'");
            Вид.Картинка    = БиблиотекаКартинок.ВнешнийИсточникДанныхКуб;
            Вид.Отображение = ОтображениеКнопки.КартинкаИТекст;
            
        КонецЦикла;
        
    КонецЕсли;  
    
КонецПроцедуры

&После("ПриОпределенииКомандПодключенныхКОбъекту")
Процедура _37583_ПриОпределенииКомандПодключенныхКОбъекту(НастройкиФормы, Источники, ПодключенныеОтчетыИОбработки, Команды)
    
    Если  РольДоступна("_37583_РедактированиеАлгоритмов") Или РольДоступна("_37583_ИспользованиеАлгоритмов") Тогда
        
        _37583_СтандартныеПодсистемы.ПриОпределенииКомандПодключенныхКОбъекту(НастройкиФормы,Источники,ПодключенныеОтчетыИОбработки,Команды);
        
    КонецЕсли;  
    
КонецПроцедуры
